[{"timestamp": "2024-08-25 19:08:59", "filename": "hamza-yusuf-muslimcentral.com-these-are-precious-days-2023-04-15.mp3", "transcript": " This audio is brought to you by Muslim Central. Please consider donating to help cover our running costs and future projects by visiting www.muslimcentral.com for the slash donate. Bismillahirrahmanirrahim. Allahumma salli ala salli m-hammad wa alaari wa s-sahbih wa sallam. We're entering into these last ten days of Ramadan. May Allah SWT accept our prayers and our fasting. Alhamdulillah these are precious days. The entire month is a very special time as all of you well know but these last ten days are particularly important days. There's an immense amount of blessing in the devotional practices but also in the charity that one gives during this time. Many people I know pay there as I cut during this time but Sadakh has also really important the Prophet of the most important. The charity is a proof. It's a demonstrative proof of somebody's faith. So there's a lot of need out there. I'm very aware of that and there are many many good causes. I hope some of you will consider what we're trying to do here by building the college. Alhamdulillah one of the great blessings of Ramadan is the return to the Quran and many mosques around the world will do their Khatm during this time. So it's a great blessing, 70,000 angels witness the Khatm. But also the spiritual power of one of the nights of the last ten days that the Prophet of the Most Highsim promised us and the Quran tells us that there is one night which is traditionally called in English and that I had a power later so Khadr and that night is worth a thousand nights. So it's just an extraordinary opportunity to get an immense amount of devotional practice with a very minimal amount of effort. So part of the reason why we were given that as an Ummah is that the previous people had very long life spans, had a lot of time for devotional practice. And so Allah Subhanahu Wa Ta'ala gave this Ummah this night of power in order to facilitate for the devotional people of this Ummah an immense amount of reward akin to the reward of the people that before us. And the Prophet of the Most Highsim said that the dua of Leyla Tarkhadres, Allahumma iñnaqa'afu'un ta'hibu l-afu'afu'anna, O Allah you are the partner, you love to pardon so pardon us forgive us. So al-Aafu is something that we're seeking and these last ten days according to the Prophet of the O'l-A'<|ar|> I.S.M. are also the days of the Ethqulman and Naur which is to be freed from the punishment of the afterlife. In many ways the world is it's like an airport but there's only two destinations. So we're waiting to get on this vehicle to take us to an infinite place of infinite bliss. And we ask Allah to free us from the other destination and also to have a direct flight as opposed to having to stop. So we ask Allah Subhanahu wa Ta'an and Shallahu t-Tuh, bless your Ramadan, make it easy, give you lots of openings and just thank you for your continued support. We're doing a lot here and we hope that you're happy with what we're doing. Tazakum al-Akhirah and wa Saddamati akum wa rahmatullah wa re-katuh."}]